tiborsimon/embedded-tdd-headers/pic/8bit/pic16f18324_tdd.h
/* Generated on 2016-07-26
===============================================================================
      P I C   T D D   R E A D Y   R E G I S T E R   D E F I N I T I O N
===============================================================================

Created by Tibor Simon - tiborsimon.io
Generator script:  https://github.com/tiborsimon/pic-definition-converter

Based on the register definition header file v1.37 provided by Microchip.
Original definition date and license: */

// Generated 11/03/2016 GMT

/*
* Copyright © 2016, Microchip Technology Inc. and its subsidiaries ("Microchip")
* All rights reserved.
*
* This software is developed by Microchip Technology Inc. and its subsidiaries ("Microchip").
*
* Redistribution and use in source and binary forms, with or without modification, are
* permitted provided that the following conditions are met:
*
*     1. Redistributions of source code must retain the above copyright notice, this list of
*        conditions and the following disclaimer.
*
*     2. Redistributions in binary form must reproduce the above copyright notice, this list
*        of conditions and the following disclaimer in the documentation and/or other
*        materials provided with the distribution.
*
*     3. Microchip's name may not be used to endorse or promote products derived from this
*        software without specific prior written permission.
*
* THIS SOFTWARE IS PROVIDED BY MICROCHIP "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
* INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR
* PURPOSE ARE DISCLAIMED.  IN NO EVENT SHALL MICROCHIP BE LIABLE FOR ANY DIRECT, INDIRECT,
* INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING BUT NOT LIMITED TO
* PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA OR PROFITS; OR BUSINESS
* INTERRUPTION) HOWSOEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
* LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF
* THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
*  */

#ifndef _PIC16F18324_H_
#define _PIC16F18324_H_

#define INDF0                         0
#define INDF1                         1
#define PCL                           2
#define STATUS                        3
#define C                             4
#define CARRY                         5
#define DC                            6
#define ZERO                          7
#define Z                             8
#define nPD                           9
#define nTO                           10
#define FSR0L                         11
#define FSR0H                         12
#define FSR1L                         13
#define FSR1H                         14
#define BSR                           15
#define BSR0                          16
#define BSR1                          17
#define BSR2                          18
#define BSR3                          19
#define BSR4                          20
#define WREG                          21
#define WREG0                         22
#define PCLATH                        23
#define INTCON                        24
#define INTEDG                        25
#define PEIE                          26
#define GIE                           27
#define PORTA                         28
#define RA0                           29
#define RA1                           30
#define RA2                           31
#define RA3                           32
#define RA4                           33
#define RA5                           34
#define PORTC                         35
#define RC0                           36
#define RC1                           37
#define RC2                           38
#define RC3                           39
#define RC4                           40
#define RC5                           41
#define PIR0                          42
#define INTF                          43
#define IOCIF                         44
#define TMR0IF                        45
#define PIR1                          46
#define TMR1IF                        47
#define TMR2IF                        48
#define BCL1IF                        49
#define SSP1IF                        50
#define TXIF                          51
#define RCIF                          52
#define ADIF                          53
#define TMR1GIF                       54
#define PIR2                          55
#define NCO1IF                        56
#define TMR4IF                        57
#define NVMIF                         58
#define C1IF                          59
#define C2IF                          60
#define TMR6IF                        61
#define PIR3                          62
#define CLC1IF                        63
#define CLC2IF                        64
#define CLC3IF                        65
#define CLC4IF                        66
#define TMR3IF                        67
#define TMR3GIF                       68
#define CSWIF                         69
#define OSFIF                         70
#define PIR4                          71
#define CCP1IF                        72
#define CCP2IF                        73
#define CCP3IF                        74
#define CCP4IF                        75
#define TMR5IF                        76
#define TMR5GIF                       77
#define CWG1IF                        78
#define CWG2IF                        79
#define TMR00                         80
#define TMR0L                         81
#define TMR01                         82
#define TMR02                         83
#define TMR03                         84
#define TMR04                         85
#define TMR05                         86
#define TMR06                         87
#define TMR07                         88
#define TMR08                         89
#define TMR0H                         90
#define TMR09                         91
#define TMR010                        92
#define TMR011                        93
#define TMR012                        94
#define TMR013                        95
#define TMR014                        96
#define TMR015                        97
#define T0CON0                        98
#define T0OUTPS                       99
#define T0OUTPS0                      100
#define T0OUTPS1                      101
#define T0OUTPS2                      102
#define T0OUTPS3                      103
#define T016BIT                       104
#define T0OUT                         105
#define T0EN                          106
#define T0CON1                        107
#define T0CKPS                        108
#define T0CKPS0                       109
#define T0CKPS1                       110
#define T0CKPS2                       111
#define T0CKPS3                       112
#define T0ASYNC                       113
#define T0CS                          114
#define T0CS0                         115
#define T0CS1                         116
#define T0CS2                         117
#define TMR1L                         118
#define TMR1H                         119
#define T1CON                         120
#define TMR1ON                        121
#define T1SYNC                        122
#define T1SOSC                        123
#define T1CKPS0                       124
#define T1CKPS                        125
#define T1CKPS1                       126
#define TMR1CS0                       127
#define TMR1CS                        128
#define TMR1CS1                       129
#define T1GCON                        130
#define T1GSS0                        131
#define T1GSS                         132
#define T1GSS1                        133
#define T1GVAL                        134
#define T1GGO_nDONE                   135
#define T1GSPM                        136
#define T1GTM                         137
#define T1GPOL                        138
#define TMR1GE                        139
#define TMR2                          140
#define PR2                           141
#define T2CON                         142
#define T2CKPS0                       143
#define T2CKPS                        144
#define T2CKPS1                       145
#define TMR2ON                        146
#define T2OUTPS0                      147
#define T2OUTPS                       148
#define T2OUTPS1                      149
#define T2OUTPS2                      150
#define T2OUTPS3                      151
#define TRISA                         152
#define TRISA0                        153
#define TRISA1                        154
#define TRISA2                        155
#define TRISA4                        156
#define TRISA5                        157
#define TRISC                         158
#define TRISC0                        159
#define TRISC1                        160
#define TRISC2                        161
#define TRISC3                        162
#define TRISC4                        163
#define TRISC5                        164
#define PIE0                          165
#define INTE                          166
#define IOCIE                         167
#define TMR0IE                        168
#define PIE1                          169
#define TMR1IE                        170
#define TMR2IE                        171
#define BCL1IE                        172
#define SSP1IE                        173
#define TXIE                          174
#define RCIE                          175
#define ADIE                          176
#define TMR1GIE                       177
#define PIE2                          178
#define NCO1IE                        179
#define TMR4IE                        180
#define NVMIE                         181
#define C1IE                          182
#define C2IE                          183
#define TMR6IE                        184
#define PIE3                          185
#define CLC1IE                        186
#define CLC2IE                        187
#define CLC3IE                        188
#define CLC4IE                        189
#define TMR3IE                        190
#define TMR3GIE                       191
#define CSWIE                         192
#define OSFIE                         193
#define PIE4                          194
#define CCP1IE                        195
#define CCP2IE                        196
#define CCP3IE                        197
#define CCP4IE                        198
#define TMR5IE                        199
#define TMR5GIE                       200
#define CWG1IE                        201
#define CWG2IE                        202
#define WDTCON                        203
#define SWDTEN                        204
#define WDTPS                         205
#define WDTPS0                        206
#define WDTPS1                        207
#define WDTPS2                        208
#define WDTPS3                        209
#define WDTPS4                        210
#define ADRESL                        211
#define ADRESH                        212
#define ADCON0                        213
#define ADON                          214
#define GO_nDONE                      215
#define GO                            216
#define ADGO                          217
#define CHS0                          218
#define CHS                           219
#define CHS1                          220
#define CHS2                          221
#define CHS3                          222
#define CHS4                          223
#define CHS5                          224
#define ADCON1                        225
#define ADPREF0                       226
#define ADPREF                        227
#define ADPREF1                       228
#define ADNREF                        229
#define ADCS0                         230
#define ADCS                          231
#define ADCS1                         232
#define ADCS2                         233
#define ADFM                          234
#define ADACT0                        235
#define ADACT                         236
#define ADACT1                        237
#define ADACT2                        238
#define ADACT3                        239
#define ADACT4                        240
#define LATA                          241
#define LATA0                         242
#define LATA1                         243
#define LATA2                         244
#define LATA4                         245
#define LATA5                         246
#define LATC                          247
#define LATC0                         248
#define LATC1                         249
#define LATC2                         250
#define LATC3                         251
#define LATC4                         252
#define LATC5                         253
#define CM1CON0                       254
#define C1SYNC                        255
#define C1HYS                         256
#define C1SP                          257
#define C1POL                         258
#define C1OUT                         259
#define C1ON                          260
#define CM1CON1                       261
#define C1NCH0                        262
#define C1NCH                         263
#define C1NCH1                        264
#define C1NCH2                        265
#define C1PCH                         266
#define C1PCH0                        267
#define C1PCH1                        268
#define C1PCH2                        269
#define C1INTN                        270
#define C1INTP                        271
#define CM2CON0                       272
#define C2SYNC                        273
#define C2HYS                         274
#define C2SP                          275
#define C2POL                         276
#define C2OUT                         277
#define C2ON                          278
#define CM2CON1                       279
#define C2NCH0                        280
#define C2NCH                         281
#define C2NCH1                        282
#define C2NCH2                        283
#define C2PCH                         284
#define C2PCH0                        285
#define C2PCH1                        286
#define C2PCH2                        287
#define C2INTN                        288
#define C2INTP                        289
#define CMOUT                         290
#define MC1OUT                        291
#define MC2OUT                        292
#define BORCON                        293
#define BORRDY                        294
#define SBOREN                        295
#define FVRCON                        296
#define ADFVR0                        297
#define ADFVR                         298
#define ADFVR1                        299
#define CDAFVR                        300
#define CDAFVR0                       301
#define CDAFVR1                       302
#define TSRNG                         303
#define TSEN                          304
#define FVRRDY                        305
#define FVREN                         306
#define DACCON0                       307
#define DAC1NSS                       308
#define DAC1PSS                       309
#define DAC1PSS0                      310
#define DAC1PSS1                      311
#define DAC1OE                        312
#define DAC1EN                        313
#define DACCON1                       314
#define DAC1R                         315
#define DAC1R0                        316
#define DAC1R1                        317
#define DAC1R2                        318
#define DAC1R3                        319
#define DAC1R4                        320
#define ANSELA                        321
#define ANSA0                         322
#define ANSA1                         323
#define ANSA2                         324
#define ANSA4                         325
#define ANSA5                         326
#define ANSELC                        327
#define ANSC0                         328
#define ANSC1                         329
#define ANSC2                         330
#define ANSC3                         331
#define ANSC4                         332
#define ANSC5                         333
#define VREGCON                       334
#define VREGPM                        335
#define RC1REG                        336
#define TX1REG                        337
#define SP1BRGL                       338
#define SP1BRGH                       339
#define RC1STA                        340
#define RX9D                          341
#define OERR                          342
#define FERR                          343
#define ADDEN                         344
#define CREN                          345
#define SREN                          346
#define RX9                           347
#define SPEN                          348
#define TX1STA                        349
#define TX9D                          350
#define TRMT                          351
#define BRGH                          352
#define SENDB                         353
#define SYNC                          354
#define TXEN                          355
#define TX9                           356
#define CSRC                          357
#define BAUD1CON                      358
#define ABDEN                         359
#define WUE                           360
#define BRG16                         361
#define SCKP                          362
#define RCIDL                         363
#define ABDOVF                        364
#define WPUA                          365
#define WPUA0                         366
#define WPUA1                         367
#define WPUA2                         368
#define WPUA3                         369
#define WPUA4                         370
#define WPUA5                         371
#define WPUC                          372
#define WPUC0                         373
#define WPUC1                         374
#define WPUC2                         375
#define WPUC3                         376
#define WPUC4                         377
#define WPUC5                         378
#define SSP1BUF                       379
#define BUF                           380
#define BUF0                          381
#define SSP1BUF0                      382
#define BUF1                          383
#define SSP1BUF1                      384
#define BUF2                          385
#define SSP1BUF2                      386
#define BUF3                          387
#define SSP1BUF3                      388
#define BUF4                          389
#define SSP1BUF4                      390
#define BUF5                          391
#define SSP1BUF5                      392
#define BUF6                          393
#define SSP1BUF6                      394
#define BUF7                          395
#define SSP1BUF7                      396
#define ADD0                          397
#define ADD                           398
#define SSP1ADD0                      399
#define SSP1ADD                       400
#define ADD1                          401
#define SSP1ADD1                      402
#define ADD2                          403
#define SSP1ADD2                      404
#define ADD3                          405
#define SSP1ADD3                      406
#define ADD4                          407
#define SSP1ADD4                      408
#define ADD5                          409
#define SSP1ADD5                      410
#define ADD6                          411
#define SSP1ADD6                      412
#define ADD7                          413
#define SSP1ADD7                      414
#define SSP1MSK0                      415
#define SSP1MSK                       416
#define MSK0                          417
#define MSK                           418
#define SSP1MSK1                      419
#define MSK1                          420
#define SSP1MSK2                      421
#define MSK2                          422
#define SSP1MSK3                      423
#define MSK3                          424
#define SSP1MSK4                      425
#define MSK4                          426
#define SSP1MSK5                      427
#define MSK5                          428
#define SSP1MSK6                      429
#define MSK6                          430
#define SSP1MSK7                      431
#define MSK7                          432
#define SSP1STAT                      433
#define BF                            434
#define UA                            435
#define R_nW                          436
#define S                             437
#define P                             438
#define D_nA                          439
#define CKE                           440
#define SMP                           441
#define SSP1CON1                      442
#define SSPM0                         443
#define SSPM                          444
#define SSPM1                         445
#define SSPM2                         446
#define SSPM3                         447
#define CKP                           448
#define SSPEN                         449
#define SSPOV                         450
#define WCOL                          451
#define SSP1CON2                      452
#define SEN                           453
#define RSEN                          454
#define PEN                           455
#define RCEN                          456
#define ACKEN                         457
#define ACKDT                         458
#define ACKSTAT                       459
#define GCEN                          460
#define SSP1CON3                      461
#define DHEN                          462
#define AHEN                          463
#define SBCDE                         464
#define SDAHT                         465
#define BOEN                          466
#define SCIE                          467
#define PCIE                          468
#define ACKTIM                        469
#define ODCONA                        470
#define ODCA0                         471
#define ODCA1                         472
#define ODCA2                         473
#define ODCA4                         474
#define ODCA5                         475
#define ODCONC                        476
#define ODCC0                         477
#define ODCC1                         478
#define ODCC2                         479
#define ODCC3                         480
#define ODCC4                         481
#define ODCC5                         482
#define CCPR1L                        483
#define CCPR1H                        484
#define CCP1CON                       485
#define CCP1MODE                      486
#define CCP1MODE0                     487
#define CCP1MODE1                     488
#define CCP1MODE2                     489
#define CCP1MODE3                     490
#define CCP1FMT                       491
#define CCP1OUT                       492
#define CCP1EN                        493
#define CCP1CAP                       494
#define CCP1CTS                       495
#define CCP1CTS0                      496
#define CCP1CTS1                      497
#define CCP1CTS2                      498
#define CCP1CTS3                      499
#define CCPR2L                        500
#define CCPR2H                        501
#define CCP2CON                       502
#define CCP2MODE                      503
#define CCP2MODE0                     504
#define CCP2MODE1                     505
#define CCP2MODE2                     506
#define CCP2MODE3                     507
#define CCP2FMT                       508
#define CCP2OUT                       509
#define CCP2EN                        510
#define CCP2CAP                       511
#define CCP2CTS                       512
#define CCP2CTS0                      513
#define CCP2CTS1                      514
#define CCP2CTS2                      515
#define CCP2CTS3                      516
#define CCPTMRS                       517
#define C1TSEL0                       518
#define C1TSEL                        519
#define C1TSEL1                       520
#define C2TSEL0                       521
