tiborsimon/embedded-tdd-headers/pic/8bit/pic16f18324_tdd.h
#define C2TSEL                        522
#define C2TSEL1                       523
#define C3TSEL0                       524
#define C3TSEL                        525
#define C3TSEL1                       526
#define C4TSEL                        527
#define C4TSEL0                       528
#define C4TSEL1                       529
#define SLRCONA                       530
#define SLRA0                         531
#define SLRA1                         532
#define SLRA2                         533
#define SLRA4                         534
#define SLRA5                         535
#define SLRCONC                       536
#define SLRC0                         537
#define SLRC1                         538
#define SLRC2                         539
#define SLRC3                         540
#define SLRC4                         541
#define SLRC5                         542
#define CCPR3L                        543
#define CCPR3H                        544
#define CCP3CON                       545
#define CCP3MODE0                     546
#define CCP3MODE                      547
#define CCP3MODE1                     548
#define CCP3MODE2                     549
#define CCP3MODE3                     550
#define CCP3FMT                       551
#define CCP3OUT                       552
#define CCP3EN                        553
#define CCP3CAP                       554
#define CCP3CTS                       555
#define CCP3CTS0                      556
#define CCP3CTS1                      557
#define CCP3CTS2                      558
#define CCP3CTS3                      559
#define CCPR4L                        560
#define CCPR4H                        561
#define CCP4CON                       562
#define CCP4MODE                      563
#define CCP4MODE0                     564
#define CCP4MODE1                     565
#define CCP4MODE2                     566
#define CCP4MODE3                     567
#define CCP4FMT                       568
#define CCP4OUT                       569
#define CCP4EN                        570
#define CCP4CAP                       571
#define CCP4CTS                       572
#define CCP4CTS0                      573
#define CCP4CTS1                      574
#define CCP4CTS2                      575
#define CCP4CTS3                      576
#define INLVLA                        577
#define INLVLA0                       578
#define INLVLA1                       579
#define INLVLA2                       580
#define INLVLA3                       581
#define INLVLA4                       582
#define INLVLA5                       583
#define INLVLC                        584
#define INLVLC0                       585
#define INLVLC1                       586
#define INLVLC2                       587
#define INLVLC3                       588
#define INLVLC4                       589
#define INLVLC5                       590
#define IOCAP                         591
#define IOCAP0                        592
#define IOCAP1                        593
#define IOCAP2                        594
#define IOCAP3                        595
#define IOCAP4                        596
#define IOCAP5                        597
#define IOCAN                         598
#define IOCAN0                        599
#define IOCAN1                        600
#define IOCAN2                        601
#define IOCAN3                        602
#define IOCAN4                        603
#define IOCAN5                        604
#define IOCAF                         605
#define IOCAF0                        606
#define IOCAF1                        607
#define IOCAF2                        608
#define IOCAF3                        609
#define IOCAF4                        610
#define IOCAF5                        611
#define IOCCP                         612
#define IOCCP0                        613
#define IOCCP1                        614
#define IOCCP2                        615
#define IOCCP3                        616
#define IOCCP4                        617
#define IOCCP5                        618
#define IOCCN                         619
#define IOCCN0                        620
#define IOCCN1                        621
#define IOCCN2                        622
#define IOCCN3                        623
#define IOCCN4                        624
#define IOCCN5                        625
#define IOCCF                         626
#define IOCCF0                        627
#define IOCCF1                        628
#define IOCCF2                        629
#define IOCCF3                        630
#define IOCCF4                        631
#define IOCCF5                        632
#define CLKRCON                       633
#define CLKRDIV                       634
#define CLKRDIV0                      635
#define CLKRDIV1                      636
#define CLKRDIV2                      637
#define CLKRDC                        638
#define CLKRDC0                       639
#define CLKRDC1                       640
#define CLKREN                        641
#define MDCON                         642
#define MDBIT                         643
#define MDOUT                         644
#define MDOPOL                        645
#define MDEN                          646
#define MDSRC                         647
#define MDMS0                         648
#define MDMS                          649
#define MDMS1                         650
#define MDMS2                         651
#define MDMS3                         652
#define MDCARH                        653
#define MDCH                          654
#define MDCH0                         655
#define MDCH1                         656
#define MDCH2                         657
#define MDCH3                         658
#define MDCHSYNC                      659
#define MDCHPOL                       660
#define MDCARL                        661
#define MDCL0                         662
#define MDCL                          663
#define MDCL1                         664
#define MDCL2                         665
#define MDCL3                         666
#define MDCLSYNC                      667
#define MDCLPOL                       668
#define CCDNA                         669
#define CCDNA0                        670
#define CCDNA1                        671
#define CCDNA2                        672
#define CCDNA4                        673
#define CCDNA5                        674
#define CCDNC                         675
#define CCDNC0                        676
#define CCDNC1                        677
#define CCDNC2                        678
#define CCDNC3                        679
#define CCDNC4                        680
#define CCDNC5                        681
#define TMR3L                         682
#define TMR3H                         683
#define T3CON                         684
#define TMR3ON                        685
#define T3SYNC                        686
#define T3SOSC                        687
#define T3CKPS                        688
#define T3CKPS0                       689
#define T3CKPS1                       690
#define TMR3CS0                       691
#define TMR3CS                        692
#define TMR3CS1                       693
#define T3GCON                        694
#define T3GSS0                        695
#define T3GSS                         696
#define T3GSS1                        697
#define T3GVAL                        698
#define T3GGO_nDONE                   699
#define T3GSPM                        700
#define T3GTM                         701
#define T3GPOL                        702
#define TMR3GE                        703
#define TMR4                          704
#define PR4                           705
#define T4CON                         706
#define T4CKPS0                       707
#define T4CKPS                        708
#define T4CKPS1                       709
#define TMR4ON                        710
#define T4OUTPS                       711
#define T4OUTPS0                      712
#define T4OUTPS1                      713
#define T4OUTPS2                      714
#define T4OUTPS3                      715
#define TMR5L                         716
#define TMR5H                         717
#define T5CON                         718
#define TMR5ON                        719
#define T5SYNC                        720
#define T5SOSC                        721
#define T5CKPS                        722
#define T5CKPS0                       723
#define T5CKPS1                       724
#define TMR5CS0                       725
#define TMR5CS                        726
#define TMR5CS1                       727
#define T5GCON                        728
#define T5GSS                         729
#define T5GSS0                        730
#define T5GSS1                        731
#define T5GVAL                        732
#define T5GGO_nDONE                   733
#define T5GSPM                        734
#define T5GTM                         735
#define T5GPOL                        736
#define TMR5GE                        737
#define TMR6                          738
#define PR6                           739
#define T6CON                         740
#define T6CKPS0                       741
#define T6CKPS                        742
#define T6CKPS1                       743
#define TMR6ON                        744
#define T6OUTPS0                      745
#define T6OUTPS                       746
#define T6OUTPS1                      747
#define T6OUTPS2                      748
#define T6OUTPS3                      749
#define CCDCON                        750
#define CCDS                          751
#define CCDS0                         752
#define CCDS1                         753
#define CCDEN                         754
#define CCDPA                         755
#define CCDPA0                        756
#define CCDPA1                        757
#define CCDPA2                        758
#define CCDPA4                        759
#define CCDPA5                        760
#define CCDPC                         761
#define CCDPC0                        762
#define CCDPC1                        763
#define CCDPC2                        764
#define CCDPC3                        765
#define CCDPC4                        766
#define CCDPC5                        767
#define NCO1ACCL                      768
#define NCO1ACCL_NCO1ACC              769
#define NCO1ACCH                      770
#define NCO1ACCH_NCO1ACC              771
#define NCO1ACCU                      772
#define NCO1ACCU_NCO1ACC              773
#define NCO1INCL                      774
#define NCO1INCL_NCO1INC              775
#define NCO1INCH                      776
#define NCO1INCH_NCO1INC              777
#define NCO1INCU                      778
#define NCO1INCU_NCO1INC              779
#define NCO1CON                       780
#define N1PFM                         781
#define N1POL                         782
#define N1OUT                         783
#define N1EN                          784
#define NCO1CLK                       785
#define N1CKS                         786
#define N1PWS                         787
#define PWM5DCL                       788
#define PWM5DCL0                      789
#define PWM5DCL1                      790
#define PWM5DCH                       791
#define PWM5DCH0                      792
#define PWM5DCH1                      793
#define PWM5DCH2                      794
#define PWM5DCH3                      795
#define PWM5DCH4                      796
#define PWM5DCH5                      797
#define PWM5DCH6                      798
#define PWM5DCH7                      799
#define PWM5CON                       800
#define PWM5POL                       801
#define PWM5OUT                       802
#define PWM5EN                        803
#define PWM6DCL                       804
#define PWM6DCL0                      805
#define PWM6DCL1                      806
#define PWM6DCH                       807
#define PWM6DCH0                      808
#define PWM6DCH1                      809
#define PWM6DCH2                      810
#define PWM6DCH3                      811
#define PWM6DCH4                      812
#define PWM6DCH5                      813
#define PWM6DCH6                      814
#define PWM6DCH7                      815
#define PWM6CON                       816
#define PWM6POL                       817
#define PWM6OUT                       818
#define PWM6EN                        819
#define PWMTMRS                       820
#define P5TSEL                        821
#define P5TSEL0                       822
#define P5TSEL1                       823
#define P6TSEL0                       824
#define P6TSEL                        825
#define P6TSEL1                       826
#define CWG1CLKCON                    827
#define CWG1CLKCON_CS                 828
#define CWG1CS                        829
#define CWG1DAT                       830
#define CWG1DAT_DAT                   831
#define CWG1DAT0                      832
#define CWG1DAT1                      833
#define CWG1DAT2                      834
#define CWG1DAT3                      835
#define CWG1DBR_DBR                   836
#define CWG1DBR0                      837
#define CWG1DBR_DBR0                  838
#define CWG1DBR                       839
#define CWG1DBR1                      840
#define CWG1DBR_DBR1                  841
#define CWG1DBR2                      842
#define CWG1DBR_DBR2                  843
#define CWG1DBR3                      844
#define CWG1DBR_DBR3                  845
#define CWG1DBR_DBR4                  846
#define CWG1DBR4                      847
#define CWG1DBR5                      848
#define CWG1DBR_DBR5                  849
#define CWG1DBF                       850
#define CWG1DBF0                      851
#define CWG1DBF_DBF                   852
#define CWG1DBF_DBF0                  853
#define CWG1DBF1                      854
#define CWG1DBF_DBF1                  855
#define CWG1DBF_DBF2                  856
#define CWG1DBF2                      857
#define CWG1DBF3                      858
#define CWG1DBF_DBF3                  859
#define CWG1DBF_DBF4                  860
#define CWG1DBF4                      861
#define CWG1DBF_DBF5                  862
#define CWG1DBF5                      863
#define CWG1CON0                      864
#define CWG1MODE0                     865
#define CWG1CON0_MODE                 866
#define CWG1CON0_MODE0                867
#define CWG1MODE                      868
#define CWG1MODE1                     869
#define CWG1CON0_MODE1                870
#define CWG1MODE2                     871
#define CWG1CON0_MODE2                872
#define CWG1CON0_LD                   873
#define CWG1LD                        874
#define CWG1EN                        875
#define G1EN                          876
#define CWG1CON0_EN                   877
#define CWG1CON1                      878
#define CWG1POLA                      879
#define CWG1CON1_POLA                 880
#define CWG1CON1_POLB                 881
#define CWG1POLB                      882
#define CWG1POLC                      883
#define CWG1CON1_POLC                 884
#define CWG1CON1_POLD                 885
#define CWG1POLD                      886
#define CWG1CON1_IN                   887
#define CWG1IN                        888
#define CWG1AS0                       889
#define CWG1LSAC                      890
#define CWG1AS0_LSAC0                 891
#define CWG1AS0_LSAC                  892
#define CWG1LSAC0                     893
#define CWG1AS0_LSAC1                 894
#define CWG1LSAC1                     895
#define CWG1AS0_LSBD0                 896
#define CWG1LSBD0                     897
#define CWG1LSBD                      898
#define CWG1AS0_LSBD                  899
#define CWG1LSBD1                     900
#define CWG1AS0_LSBD1                 901
#define CWG1AS0_REN                   902
#define CWG1REN                       903
#define CWG1AS0_SHUTDOWN              904
#define CWG1SHUTDOWN                  905
#define CWG1AS1                       906
#define CWG1AS1_AS0E                  907
#define CWG1AS1_AS1E                  908
#define CWG1AS1_AS2E                  909
#define CWG1AS1_AS3E                  910
#define CWG1AS1_AS4E                  911
#define CWG1STR                       912
#define CWG1STRA                      913
#define CWG1STR_STRA                  914
#define CWG1STRB                      915
#define CWG1STR_STRB                  916
#define CWG1STRC                      917
#define CWG1STR_STRC                  918
#define CWG1STR_STRD                  919
#define CWG1STRD                      920
#define CWG1OVRA                      921
#define CWG1STR_OVRA                  922
#define CWG1OVRB                      923
#define CWG1STR_OVRB                  924
#define CWG1OVRC                      925
#define CWG1STR_OVRC                  926
#define CWG1OVRD                      927
#define CWG1STR_OVRD                  928
#define CWG2CLKCON                    929
#define CWG2CS                        930
#define CWG2CLKCON_CS                 931
#define CWG2DAT                       932
#define CWG2DAT0                      933
#define CWG2DAT_DAT                   934
#define CWG2DAT1                      935
#define CWG2DAT2                      936
#define CWG2DAT3                      937
#define CWG2DBR_DBR                   938
#define CWG2DBR_DBR0                  939
#define CWG2DBR                       940
#define CWG2DBR0                      941
#define CWG2DBR_DBR1                  942
#define CWG2DBR1                      943
#define CWG2DBR_DBR2                  944
#define CWG2DBR2                      945
#define CWG2DBR_DBR3                  946
#define CWG2DBR3                      947
#define CWG2DBR_DBR4                  948
#define CWG2DBR4                      949
#define CWG2DBR_DBR5                  950
#define CWG2DBR5                      951
#define CWG2DBF                       952
#define CWG2DBF_DBF0                  953
#define CWG2DBF_DBF                   954
#define CWG2DBF0                      955
#define CWG2DBF_DBF1                  956
#define CWG2DBF1                      957
#define CWG2DBF_DBF2                  958
#define CWG2DBF2                      959
#define CWG2DBF_DBF3                  960
#define CWG2DBF3                      961
#define CWG2DBF_DBF4                  962
#define CWG2DBF4                      963
#define CWG2DBF5                      964
#define CWG2DBF_DBF5                  965
#define CWG2CON0                      966
#define CWG2MODE                      967
#define CWG2MODE0                     968
#define CWG2CON0_MODE                 969
#define CWG2CON0_MODE0                970
#define CWG2MODE1                     971
#define CWG2CON0_MODE1                972
#define CWG2MODE2                     973
#define CWG2CON0_MODE2                974
#define CWG2LD                        975
#define CWG2CON0_LD                   976
#define CWG2CON0_EN                   977
#define CWG2EN                        978
#define G2EN                          979
#define CWG2CON1                      980
#define CWG2POLA                      981
#define CWG2CON1_POLA                 982
#define CWG2POLB                      983
#define CWG2CON1_POLB                 984
#define CWG2POLC                      985
#define CWG2CON1_POLC                 986
#define CWG2CON1_POLD                 987
#define CWG2POLD                      988
#define CWG2IN                        989
#define CWG2CON1_IN                   990
#define CWG2AS0                       991
#define CWG2LSAC                      992
#define CWG2AS0_LSAC                  993
#define CWG2LSAC0                     994
#define CWG2AS0_LSAC0                 995
#define CWG2LSAC1                     996
#define CWG2AS0_LSAC1                 997
#define CWG2AS0_LSBD0                 998
#define CWG2LSBD                      999
#define CWG2AS0_LSBD                  1000
#define CWG2LSBD0                     1001
#define CWG2AS0_LSBD1                 1002
#define CWG2LSBD1                     1003
#define CWG2AS0_REN                   1004
#define CWG2REN                       1005
#define CWG2AS0_SHUTDOWN              1006
#define CWG2SHUTDOWN                  1007
#define CWG2AS1                       1008
#define CWG2AS1_AS0E                  1009
#define CWG2AS1_AS1E                  1010
#define CWG2AS1_AS2E                  1011
#define CWG2AS1_AS3E                  1012
#define CWG2AS1_AS4E                  1013
#define CWG2STR                       1014
#define CWG2STR_STRA                  1015
#define CWG2STRA                      1016
#define CWG2STR_STRB                  1017
#define CWG2STRB                      1018
#define CWG2STR_STRC                  1019
#define CWG2STRC                      1020
#define CWG2STR_STRD                  1021
#define CWG2STRD                      1022
#define CWG2STR_OVRA                  1023
#define CWG2OVRA                      1024
#define CWG2OVRB                      1025
#define CWG2STR_OVRB                  1026
#define CWG2STR_OVRC                  1027
#define CWG2OVRC                      1028
#define CWG2OVRD                      1029
#define CWG2STR_OVRD                  1030
#define NVMADR0                       1031
#define NVMADRL                       1032
#define NVMADR1                       1033
#define NVMADR2                       1034
#define NVMADR3                       1035
#define NVMADR4                       1036
#define NVMADR5                       1037
#define NVMADR6                       1038
#define NVMADR7                       1039
#define NVMADR8                       1040
#define NVMADRH                       1041
#define NVMADR9                       1042
#define NVMADR10                      1043
#define NVMADR11                      1044
#define NVMADR12                      1045
#define NVMADR13                      1046
#define NVMADR14                      1047
#define NVMDAT0                       1048
#define NVMDATL                       1049
#define NVMDAT1                       1050
#define NVMDAT2                       1051
#define NVMDAT3                       1052
#define NVMDAT4                       1053
#define NVMDAT5                       1054
#define NVMDAT6                       1055
#define NVMDAT7                       1056
#define NVMDAT8                       1057
#define NVMDATH                       1058
#define NVMDAT9                       1059
#define NVMDAT10                      1060
#define NVMDAT11                      1061
#define NVMDAT12                      1062
#define NVMDAT13                      1063
#define NVMCON1                       1064
#define RD                            1065
#define WR                            1066
#define WREN                          1067
#define WRERR                         1068
#define FREE                          1069
#define LWLO                          1070
#define NVMREGS                       1071
#define NVMCON2                       1072
#define NMVCON2                       1073
#define PCON0                         1074
#define nBOR                          1075
#define nPOR                          1076
#define nRI                           1077
#define nRMCLR                        1078
#define nRWDT                         1079
#define STKUNF                        1080
#define STKOVF                        1081
#define PMD0                          1082
#define IOCMD                         1083
#define CLKRMD                        1084
#define NVMMD                         1085
#define FVRMD                         1086
#define SYSCMD                        1087
#define PMD1                          1088
#define TMR0MD                        1089
#define TMR1MD                        1090
