tiborsimon/embedded-tdd-headers/pic/8bit/pic16f18324_tdd.h
#define TMR2MD                        1091
#define TMR3MD                        1092
#define TMR4MD                        1093
#define TMR5MD                        1094
#define TMR6MD                        1095
#define NCOMD                         1096
#define PMD2                          1097
#define CMP1MD                        1098
#define CMP2MD                        1099
#define ADCMD                         1100
#define DACMD                         1101
#define PMD3                          1102
#define CCP1MD                        1103
#define CCP2MD                        1104
#define CCP3MD                        1105
#define CCP4MD                        1106
#define PWM5MD                        1107
#define PWM6MD                        1108
#define CWG1MD                        1109
#define CWG2MD                        1110
#define PMD4                          1111
#define MSSP1MD                       1112
#define UART1MD                       1113
#define PMD5                          1114
#define DSMMD                         1115
#define CLC1MD                        1116
#define CLC2MD                        1117
#define CLC3MD                        1118
#define CLC4MD                        1119
#define CPUDOZE                       1120
#define DOZE0                         1121
#define DOZE                          1122
#define DOZE1                         1123
#define DOZE2                         1124
#define DOE                           1125
#define ROI                           1126
#define DOZEN                         1127
#define IDLEN                         1128
#define OSCCON1                       1129
#define NDIV0                         1130
#define NDIV                          1131
#define NDIV1                         1132
#define NDIV2                         1133
#define NDIV3                         1134
#define NOSC0                         1135
#define NOSC                          1136
#define NOSC1                         1137
#define NOSC2                         1138
#define OSCCON2                       1139
#define CDIV0                         1140
#define CDIV                          1141
#define CDIV1                         1142
#define CDIV2                         1143
#define CDIV3                         1144
#define COSC                          1145
#define COSC0                         1146
#define COSC1                         1147
#define COSC2                         1148
#define OSCCON3                       1149
#define NOSCR                         1150
#define ORDY                          1151
#define SOSCBE                        1152
#define SOSCPWR                       1153
#define CSWHOLD                       1154
#define OSCSTAT1                      1155
#define PLLR                          1156
#define ADOR                          1157
#define SOR                           1158
#define LFOR                          1159
#define HFOR                          1160
#define EXTOR                         1161
#define OSCEN                         1162
#define ADOEN                         1163
#define SOSCEN                        1164
#define LFOEN                         1165
#define HFOEN                         1166
#define EXTOEN                        1167
#define OSCTUNE                       1168
#define HFTUN0                        1169
#define HFTUN                         1170
#define HFTUN1                        1171
#define HFTUN2                        1172
#define HFTUN3                        1173
#define HFTUN4                        1174
#define HFTUN5                        1175
#define OSCFRQ                        1176
#define HFFRQ                         1177
#define HFFRQ0                        1178
#define HFFRQ1                        1179
#define HFFRQ2                        1180
#define HFFRQ3                        1181
#define PPSLOCK                       1182
#define PPSLOCKED                     1183
#define INTPPS0                       1184
#define INTPPS                        1185
#define INTPPS1                       1186
#define INTPPS2                       1187
#define INTPPS3                       1188
#define INTPPS4                       1189
#define T0CKIPPS0                     1190
#define T0CKIPPS                      1191
#define T0CKIPPS1                     1192
#define T0CKIPPS2                     1193
#define T0CKIPPS3                     1194
#define T0CKIPPS4                     1195
#define T1CKIPPS0                     1196
#define T1CKIPPS                      1197
#define T1CKIPPS1                     1198
#define T1CKIPPS2                     1199
#define T1CKIPPS3                     1200
#define T1CKIPPS4                     1201
#define T1GPPS0                       1202
#define T1GPPS                        1203
#define T1GPPS1                       1204
#define T1GPPS2                       1205
#define T1GPPS3                       1206
#define T1GPPS4                       1207
#define CCP1PPS0                      1208
#define CCP1PPS                       1209
#define CCP1PPS1                      1210
#define CCP1PPS2                      1211
#define CCP1PPS3                      1212
#define CCP1PPS4                      1213
#define CCP2PPS0                      1214
#define CCP2PPS                       1215
#define CCP2PPS1                      1216
#define CCP2PPS2                      1217
#define CCP2PPS3                      1218
#define CCP2PPS4                      1219
#define CCP3PPS0                      1220
#define CCP3PPS                       1221
#define CCP3PPS1                      1222
#define CCP3PPS2                      1223
#define CCP3PPS3                      1224
#define CCP3PPS4                      1225
#define CCP4PPS0                      1226
#define CCP4PPS                       1227
#define CCP4PPS1                      1228
#define CCP4PPS2                      1229
#define CCP4PPS3                      1230
#define CCP4PPS4                      1231
#define CWG1PPS0                      1232
#define CWG1PPS                       1233
#define CWG1PPS1                      1234
#define CWG1PPS2                      1235
#define CWG1PPS3                      1236
#define CWG1PPS4                      1237
#define CWG2PPS0                      1238
#define CWG2PPS                       1239
#define CWG2PPS1                      1240
#define CWG2PPS2                      1241
#define CWG2PPS3                      1242
#define CWG2PPS4                      1243
#define MDCIN1PPS                     1244
#define MDCIN1PPS0                    1245
#define MDCIN1PPS1                    1246
#define MDCIN1PPS2                    1247
#define MDCIN1PPS3                    1248
#define MDCIN1PPS4                    1249
#define MDCIN2PPS0                    1250
#define MDCIN2PPS                     1251
#define MDCIN2PPS1                    1252
#define MDCIN2PPS2                    1253
#define MDCIN2PPS3                    1254
#define MDCIN2PPS4                    1255
#define MDMINPPS                      1256
#define MDMINPPS0                     1257
#define MDMINPPS1                     1258
#define MDMINPPS2                     1259
#define MDMINPPS3                     1260
#define MDMINPPS4                     1261
#define SSP1CLKPPS0                   1262
#define SSP1CLKPPS                    1263
#define SSP1CLKPPS1                   1264
#define SSP1CLKPPS2                   1265
#define SSP1CLKPPS3                   1266
#define SSP1CLKPPS4                   1267
#define SSP1DATPPS0                   1268
#define SSP1DATPPS                    1269
#define SSP1DATPPS1                   1270
#define SSP1DATPPS2                   1271
#define SSP1DATPPS3                   1272
#define SSP1DATPPS4                   1273
#define SSP1SSPPS                     1274
#define SSP1SSPPS0                    1275
#define SSP1SSPPS1                    1276
#define SSP1SSPPS2                    1277
#define SSP1SSPPS3                    1278
#define SSP1SSPPS4                    1279
#define RXPPS                         1280
#define RXDTPPS0                      1281
#define RXDTPPS1                      1282
#define RXDTPPS2                      1283
#define RXDTPPS3                      1284
#define RXDTPPS4                      1285
#define TXCKPPS0                      1286
#define TXPPS                         1287
#define TXCKPPS1                      1288
#define TXCKPPS2                      1289
#define TXCKPPS3                      1290
#define TXCKPPS4                      1291
#define CLCIN0PPS                     1292
#define CLCIN0PPS0                    1293
#define CLCIN0PPS1                    1294
#define CLCIN0PPS2                    1295
#define CLCIN0PPS3                    1296
#define CLCIN0PPS4                    1297
#define CLCIN1PPS0                    1298
#define CLCIN1PPS                     1299
#define CLCIN1PPS1                    1300
#define CLCIN1PPS2                    1301
#define CLCIN1PPS3                    1302
#define CLCIN1PPS4                    1303
#define CLCIN2PPS                     1304
#define CLCIN2PPS0                    1305
#define CLCIN2PPS1                    1306
#define CLCIN2PPS2                    1307
#define CLCIN2PPS3                    1308
#define CLCIN2PPS4                    1309
#define CLCIN3PPS                     1310
#define CLCIN3PPS0                    1311
#define CLCIN3PPS1                    1312
#define CLCIN3PPS2                    1313
#define CLCIN3PPS3                    1314
#define CLCIN3PPS4                    1315
#define T3CKIPPS                      1316
#define T3GPPS                        1317
#define T5CKIPPS                      1318
#define T5GPPS                        1319
#define RA0PPS                        1320
#define RA0PPS0                       1321
#define RA0PPS1                       1322
#define RA0PPS2                       1323
#define RA0PPS3                       1324
#define RA0PPS4                       1325
#define RA1PPS                        1326
#define RA1PPS0                       1327
#define RA1PPS1                       1328
#define RA1PPS2                       1329
#define RA1PPS3                       1330
#define RA1PPS4                       1331
#define RA2PPS0                       1332
#define RA2PPS                        1333
#define RA2PPS1                       1334
#define RA2PPS2                       1335
#define RA2PPS3                       1336
#define RA2PPS4                       1337
#define RA4PPS                        1338
#define RA4PPS0                       1339
#define RA4PPS1                       1340
#define RA4PPS2                       1341
#define RA4PPS3                       1342
#define RA4PPS4                       1343
#define RA5PPS                        1344
#define RA5PPS0                       1345
#define RA5PPS1                       1346
#define RA5PPS2                       1347
#define RA5PPS3                       1348
#define RA5PPS4                       1349
#define RC0PPS                        1350
#define RC0PPS0                       1351
#define RC0PPS1                       1352
#define RC0PPS2                       1353
#define RC0PPS3                       1354
#define RC0PPS4                       1355
#define RC1PPS0                       1356
#define RC1PPS                        1357
#define RC1PPS1                       1358
#define RC1PPS2                       1359
#define RC1PPS3                       1360
#define RC1PPS4                       1361
#define RC2PPS                        1362
#define RC2PPS0                       1363
#define RC2PPS1                       1364
#define RC2PPS2                       1365
#define RC2PPS3                       1366
#define RC2PPS4                       1367
#define RC3PPS                        1368
#define RC3PPS0                       1369
#define RC3PPS1                       1370
#define RC3PPS2                       1371
#define RC3PPS3                       1372
#define RC3PPS4                       1373
#define RC4PPS0                       1374
#define RC4PPS                        1375
#define RC4PPS1                       1376
#define RC4PPS2                       1377
#define RC4PPS3                       1378
#define RC4PPS4                       1379
#define RC5PPS0                       1380
#define RC5PPS                        1381
#define RC5PPS1                       1382
#define RC5PPS2                       1383
#define RC5PPS3                       1384
#define RC5PPS4                       1385
#define CLCDATA                       1386
#define MLC1OUT                       1387
#define MLC2OUT                       1388
#define MLC3OUT                       1389
#define MLC4OUT                       1390
#define CLC1CON                       1391
#define CLC1CON_MODE0                 1392
#define LC1MODE                       1393
#define CLC1CON_MODE                  1394
#define LC1MODE0                      1395
#define CLC1CON_MODE1                 1396
#define LC1MODE1                      1397
#define LC1MODE2                      1398
#define CLC1CON_MODE2                 1399
#define LC1INTN                       1400
#define CLC1CON_INTN                  1401
#define CLC1CON_INTP                  1402
#define LC1INTP                       1403
#define LC1OUT                        1404
#define CLC1CON_OUT                   1405
#define CLC1CON_EN                    1406
#define LC1EN                         1407
#define CLC1POL                       1408
#define LC1G1POL                      1409
#define CLC1POL_G1POL                 1410
#define CLC1POL_G2POL                 1411
#define LC1G2POL                      1412
#define LC1G3POL                      1413
#define CLC1POL_G3POL                 1414
#define LC1G4POL                      1415
#define CLC1POL_G4POL                 1416
#define CLC1POL_POL                   1417
#define LC1POL                        1418
#define CLC1SEL0                      1419
#define CLC1SEL0_D1S0                 1420
#define LC1D1S0                       1421
#define CLC1SEL0_D1S                  1422
#define LC1D1S                        1423
#define CLC1SEL0_D1S1                 1424
#define LC1D1S1                       1425
#define CLC1SEL0_D1S2                 1426
#define LC1D1S2                       1427
#define LC1D1S3                       1428
#define CLC1SEL0_D1S3                 1429
#define CLC1SEL0_D1S4                 1430
#define LC1D1S4                       1431
#define CLC1SEL0_D1S5                 1432
#define LC1D1S5                       1433
#define CLC1SEL1                      1434
#define CLC1SEL1_D2S0                 1435
#define CLC1SEL1_D2S                  1436
#define LC1D2S                        1437
#define LC1D2S0                       1438
#define CLC1SEL1_D2S1                 1439
#define LC1D2S1                       1440
#define CLC1SEL1_D2S2                 1441
#define LC1D2S2                       1442
#define LC1D2S3                       1443
#define CLC1SEL1_D2S3                 1444
#define LC1D2S4                       1445
#define CLC1SEL1_D2S4                 1446
#define LC1D2S5                       1447
#define CLC1SEL1_D2S5                 1448
#define CLC1SEL2                      1449
#define LC1D3S0                       1450
#define CLC1SEL2_D3S                  1451
#define LC1D3S                        1452
#define CLC1SEL2_D3S0                 1453
#define LC1D3S1                       1454
#define CLC1SEL2_D3S1                 1455
#define LC1D3S2                       1456
#define CLC1SEL2_D3S2                 1457
#define LC1D3S3                       1458
#define CLC1SEL2_D3S3                 1459
#define LC1D3S4                       1460
#define CLC1SEL2_D3S4                 1461
#define LC1D3S5                       1462
#define CLC1SEL2_D3S5                 1463
#define CLC1SEL3                      1464
#define CLC1SEL3_D4S                  1465
#define LC1D4S                        1466
#define LC1D4S0                       1467
#define CLC1SEL3_D4S0                 1468
#define CLC1SEL3_D4S1                 1469
#define LC1D4S1                       1470
#define LC1D4S2                       1471
#define CLC1SEL3_D4S2                 1472
#define LC1D4S3                       1473
#define CLC1SEL3_D4S3                 1474
#define LC1D4S4                       1475
#define CLC1SEL3_D4S4                 1476
#define LC1D4S5                       1477
#define CLC1SEL3_D4S5                 1478
#define CLC1GLS0                      1479
#define CLC1GLS0_D1N                  1480
#define LC1G1D1N                      1481
#define CLC1GLS0_D1T                  1482
#define LC1G1D1T                      1483
#define LC1G1D2N                      1484
#define CLC1GLS0_D2N                  1485
#define LC1G1D2T                      1486
#define CLC1GLS0_D2T                  1487
#define CLC1GLS0_D3N                  1488
#define LC1G1D3N                      1489
#define CLC1GLS0_D3T                  1490
#define LC1G1D3T                      1491
#define CLC1GLS0_D4N                  1492
#define LC1G1D4N                      1493
#define CLC1GLS0_D4T                  1494
#define LC1G1D4T                      1495
#define CLC1GLS1                      1496
#define CLC1GLS1_D1N                  1497
#define LC1G2D1N                      1498
#define LC1G2D1T                      1499
#define CLC1GLS1_D1T                  1500
#define CLC1GLS1_D2N                  1501
#define LC1G2D2N                      1502
#define LC1G2D2T                      1503
#define CLC1GLS1_D2T                  1504
#define CLC1GLS1_D3N                  1505
#define LC1G2D3N                      1506
#define LC1G2D3T                      1507
#define CLC1GLS1_D3T                  1508
#define CLC1GLS1_D4N                  1509
#define LC1G2D4N                      1510
#define LC1G2D4T                      1511
#define CLC1GLS1_D4T                  1512
#define CLC1GLS2                      1513
#define CLC1GLS2_D1N                  1514
#define LC1G3D1N                      1515
#define LC1G3D1T                      1516
#define CLC1GLS2_D1T                  1517
#define LC1G3D2N                      1518
#define CLC1GLS2_D2N                  1519
#define LC1G3D2T                      1520
#define CLC1GLS2_D2T                  1521
#define CLC1GLS2_D3N                  1522
#define LC1G3D3N                      1523
#define LC1G3D3T                      1524
#define CLC1GLS2_D3T                  1525
#define LC1G3D4N                      1526
#define CLC1GLS2_D4N                  1527
#define LC1G3D4T                      1528
#define CLC1GLS2_D4T                  1529
#define CLC1GLS3                      1530
#define LC1G4D1N                      1531
#define CLC1GLS3_G4D1N                1532
#define LC1G4D1T                      1533
#define CLC1GLS3_G4D1T                1534
#define CLC1GLS3_G4D2N                1535
#define LC1G4D2N                      1536
#define CLC1GLS3_G4D2T                1537
#define LC1G4D2T                      1538
#define LC1G4D3N                      1539
#define CLC1GLS3_G4D3N                1540
#define LC1G4D3T                      1541
#define CLC1GLS3_G4D3T                1542
#define CLC1GLS3_G4D4N                1543
#define LC1G4D4N                      1544
#define CLC1GLS3_G4D4T                1545
#define LC1G4D4T                      1546
#define CLC2CON                       1547
#define LC2MODE0                      1548
#define CLC2CON_MODE                  1549
#define LC2MODE                       1550
#define CLC2CON_MODE0                 1551
#define LC2MODE1                      1552
#define CLC2CON_MODE1                 1553
#define LC2MODE2                      1554
#define CLC2CON_MODE2                 1555
#define LC2INTN                       1556
#define CLC2CON_INTN                  1557
#define LC2INTP                       1558
#define CLC2CON_INTP                  1559
#define CLC2CON_OUT                   1560
#define LC2OUT                        1561
#define CLC2CON_EN                    1562
#define LC2EN                         1563
#define CLC2POL                       1564
#define LC2G1POL                      1565
#define CLC2POL_G1POL                 1566
#define LC2G2POL                      1567
#define CLC2POL_G2POL                 1568
#define LC2G3POL                      1569
#define CLC2POL_G3POL                 1570
#define LC2G4POL                      1571
#define CLC2POL_G4POL                 1572
#define CLC2POL_POL                   1573
#define LC2POL                        1574
#define CLC2SEL0                      1575
#define CLC2SEL0_D1S                  1576
#define LC2D1S0                       1577
#define CLC2SEL0_D1S0                 1578
#define LC2D1S                        1579
#define LC2D1S1                       1580
#define CLC2SEL0_D1S1                 1581
#define LC2D1S2                       1582
#define CLC2SEL0_D1S2                 1583
#define CLC2SEL0_D1S3                 1584
#define LC2D1S3                       1585
#define LC2D1S4                       1586
#define CLC2SEL0_D1S4                 1587
#define LC2D1S5                       1588
#define CLC2SEL0_D1S5                 1589
#define CLC2SEL1                      1590
#define LC2D2S0                       1591
#define CLC2SEL1_D2S0                 1592
#define LC2D2S                        1593
#define CLC2SEL1_D2S                  1594
#define LC2D2S1                       1595
#define CLC2SEL1_D2S1                 1596
#define LC2D2S2                       1597
#define CLC2SEL1_D2S2                 1598
#define LC2D2S3                       1599
#define CLC2SEL1_D2S3                 1600
#define LC2D2S4                       1601
#define CLC2SEL1_D2S4                 1602
#define LC2D2S5                       1603
#define CLC2SEL1_D2S5                 1604
#define CLC2SEL2                      1605
#define CLC2SEL2_D3S                  1606
#define LC2D3S0                       1607
#define CLC2SEL2_D3S0                 1608
#define LC2D3S                        1609
#define CLC2SEL2_D3S1                 1610
#define LC2D3S1                       1611
#define LC2D3S2                       1612
#define CLC2SEL2_D3S2                 1613
#define LC2D3S3                       1614
#define CLC2SEL2_D3S3                 1615
#define LC2D3S4                       1616
#define CLC2SEL2_D3S4                 1617
#define LC2D3S5                       1618
#define CLC2SEL2_D3S5                 1619
#define CLC2SEL3                      1620
#define LC2D4S0                       1621
#define CLC2SEL3_D4S                  1622
#define CLC2SEL3_D4S0                 1623
#define LC2D4S                        1624
#define LC2D4S1                       1625
#define CLC2SEL3_D4S1                 1626
#define LC2D4S2                       1627
#define CLC2SEL3_D4S2                 1628
#define CLC2SEL3_D4S3                 1629
#define LC2D4S3                       1630
#define LC2D4S4                       1631
#define CLC2SEL3_D4S4                 1632
#define LC2D4S5                       1633
#define CLC2SEL3_D4S5                 1634
#define CLC2GLS0                      1635
#define LC2G1D1N                      1636
#define CLC2GLS0_D1N                  1637
#define CLC2GLS0_D1T                  1638
#define LC2G1D1T                      1639
#define LC2G1D2N                      1640
#define CLC2GLS0_D2N                  1641
#define CLC2GLS0_D2T                  1642
#define LC2G1D2T                      1643
#define LC2G1D3N                      1644
#define CLC2GLS0_D3N                  1645
#define CLC2GLS0_D3T                  1646
#define LC2G1D3T                      1647
#define LC2G1D4N                      1648
