tiborsimon/embedded-tdd-headers/pic/8bit/pic16f18324_tdd.h
#define CLC2GLS0_D4N                  1649
#define CLC2GLS0_D4T                  1650
#define LC2G1D4T                      1651
#define CLC2GLS1                      1652
#define CLC2GLS1_D1N                  1653
#define LC2G2D1N                      1654
#define CLC2GLS1_D1T                  1655
#define LC2G2D1T                      1656
#define CLC2GLS1_D2N                  1657
#define LC2G2D2N                      1658
#define CLC2GLS1_D2T                  1659
#define LC2G2D2T                      1660
#define LC2G2D3N                      1661
#define CLC2GLS1_D3N                  1662
#define LC2G2D3T                      1663
#define CLC2GLS1_D3T                  1664
#define LC2G2D4N                      1665
#define CLC2GLS1_D4N                  1666
#define LC2G2D4T                      1667
#define CLC2GLS1_D4T                  1668
#define CLC2GLS2                      1669
#define LC2G3D1N                      1670
#define CLC2GLS2_D1N                  1671
#define CLC2GLS2_D1T                  1672
#define LC2G3D1T                      1673
#define CLC2GLS2_D2N                  1674
#define LC2G3D2N                      1675
#define LC2G3D2T                      1676
#define CLC2GLS2_D2T                  1677
#define CLC2GLS2_D3N                  1678
#define LC2G3D3N                      1679
#define CLC2GLS2_D3T                  1680
#define LC2G3D3T                      1681
#define CLC2GLS2_D4N                  1682
#define LC2G3D4N                      1683
#define LC2G3D4T                      1684
#define CLC2GLS2_D4T                  1685
#define CLC2GLS3                      1686
#define LC2G4D1N                      1687
#define CLC2GLS3_G4D1N                1688
#define CLC2GLS3_G4D1T                1689
#define LC2G4D1T                      1690
#define CLC2GLS3_G4D2N                1691
#define LC2G4D2N                      1692
#define LC2G4D2T                      1693
#define CLC2GLS3_G4D2T                1694
#define CLC2GLS3_G4D3N                1695
#define LC2G4D3N                      1696
#define CLC2GLS3_G4D3T                1697
#define LC2G4D3T                      1698
#define LC2G4D4N                      1699
#define CLC2GLS3_G4D4N                1700
#define CLC2GLS3_G4D4T                1701
#define LC2G4D4T                      1702
#define CLC3CON                       1703
#define LC3MODE                       1704
#define CLC3CON_MODE0                 1705
#define LC3MODE0                      1706
#define CLC3CON_MODE                  1707
#define CLC3CON_MODE1                 1708
#define LC3MODE1                      1709
#define CLC3CON_MODE2                 1710
#define LC3MODE2                      1711
#define LC3INTN                       1712
#define CLC3CON_INTN                  1713
#define LC3INTP                       1714
#define CLC3CON_INTP                  1715
#define LC3OUT                        1716
#define CLC3CON_OUT                   1717
#define LC3EN                         1718
#define CLC3CON_EN                    1719
#define CLC3POL                       1720
#define LC3G1POL                      1721
#define CLC3POL_G1POL                 1722
#define LC3G2POL                      1723
#define CLC3POL_G2POL                 1724
#define CLC3POL_G3POL                 1725
#define LC3G3POL                      1726
#define LC3G4POL                      1727
#define CLC3POL_G4POL                 1728
#define LC3POL                        1729
#define CLC3POL_POL                   1730
#define CLC3SEL0                      1731
#define CLC3SEL0_D1S0                 1732
#define LC3D1S0                       1733
#define CLC3SEL0_D1S                  1734
#define LC3D1S                        1735
#define LC3D1S1                       1736
#define CLC3SEL0_D1S1                 1737
#define LC3D1S2                       1738
#define CLC3SEL0_D1S2                 1739
#define LC3D1S3                       1740
#define CLC3SEL0_D1S3                 1741
#define LC3D1S4                       1742
#define CLC3SEL0_D1S4                 1743
#define LC3D1S5                       1744
#define CLC3SEL0_D1S5                 1745
#define CLC3SEL1                      1746
#define CLC3SEL1_D2S                  1747
#define CLC3SEL1_D2S0                 1748
#define LC3D2S                        1749
#define LC3D2S0                       1750
#define CLC3SEL1_D2S1                 1751
#define LC3D2S1                       1752
#define CLC3SEL1_D2S2                 1753
#define LC3D2S2                       1754
#define CLC3SEL1_D2S3                 1755
#define LC3D2S3                       1756
#define CLC3SEL1_D2S4                 1757
#define LC3D2S4                       1758
#define CLC3SEL1_D2S5                 1759
#define LC3D2S5                       1760
#define CLC3SEL2                      1761
#define LC3D3S                        1762
#define CLC3SEL2_D3S                  1763
#define LC3D3S0                       1764
#define CLC3SEL2_D3S0                 1765
#define LC3D3S1                       1766
#define CLC3SEL2_D3S1                 1767
#define LC3D3S2                       1768
#define CLC3SEL2_D3S2                 1769
#define LC3D3S3                       1770
#define CLC3SEL2_D3S3                 1771
#define CLC3SEL2_D3S4                 1772
#define LC3D3S4                       1773
#define CLC3SEL2_D3S5                 1774
#define LC3D3S5                       1775
#define CLC3SEL3                      1776
#define CLC3SEL3_D4S0                 1777
#define LC3D4S0                       1778
#define CLC3SEL3_D4S                  1779
#define LC3D4S                        1780
#define LC3D4S1                       1781
#define CLC3SEL3_D4S1                 1782
#define LC3D4S2                       1783
#define CLC3SEL3_D4S2                 1784
#define LC3D4S3                       1785
#define CLC3SEL3_D4S3                 1786
#define LC3D4S4                       1787
#define CLC3SEL3_D4S4                 1788
#define LC3D4S5                       1789
#define CLC3SEL3_D4S5                 1790
#define CLC3GLS0                      1791
#define CLC3GLS0_D1N                  1792
#define LC3G1D1N                      1793
#define LC3G1D1T                      1794
#define CLC3GLS0_D1T                  1795
#define LC3G1D2N                      1796
#define CLC3GLS0_D2N                  1797
#define CLC3GLS0_D2T                  1798
#define LC3G1D2T                      1799
#define CLC3GLS0_D3N                  1800
#define LC3G1D3N                      1801
#define LC3G1D3T                      1802
#define CLC3GLS0_D3T                  1803
#define CLC3GLS0_D4N                  1804
#define LC3G1D4N                      1805
#define CLC3GLS0_D4T                  1806
#define LC3G1D4T                      1807
#define CLC3GLS1                      1808
#define LC3G2D1N                      1809
#define CLC3GLS1_D1N                  1810
#define CLC3GLS1_D1T                  1811
#define LC3G2D1T                      1812
#define LC3G2D2N                      1813
#define CLC3GLS1_D2N                  1814
#define LC3G2D2T                      1815
#define CLC3GLS1_D2T                  1816
#define LC3G2D3N                      1817
#define CLC3GLS1_D3N                  1818
#define CLC3GLS1_D3T                  1819
#define LC3G2D3T                      1820
#define LC3G2D4N                      1821
#define CLC3GLS1_D4N                  1822
#define LC3G2D4T                      1823
#define CLC3GLS1_D4T                  1824
#define CLC3GLS2                      1825
#define LC3G3D1N                      1826
#define CLC3GLS2_D1N                  1827
#define LC3G3D1T                      1828
#define CLC3GLS2_D1T                  1829
#define CLC3GLS2_D2N                  1830
#define LC3G3D2N                      1831
#define CLC3GLS2_D2T                  1832
#define LC3G3D2T                      1833
#define CLC3GLS2_D3N                  1834
#define LC3G3D3N                      1835
#define LC3G3D3T                      1836
#define CLC3GLS2_D3T                  1837
#define CLC3GLS2_D4N                  1838
#define LC3G3D4N                      1839
#define CLC3GLS2_D4T                  1840
#define LC3G3D4T                      1841
#define CLC3GLS3                      1842
#define LC3G4D1N                      1843
#define CLC3GLS3_G4D1N                1844
#define LC3G4D1T                      1845
#define CLC3GLS3_G4D1T                1846
#define LC3G4D2N                      1847
#define CLC3GLS3_G4D2N                1848
#define CLC3GLS3_G4D2T                1849
#define LC3G4D2T                      1850
#define LC3G4D3N                      1851
#define CLC3GLS3_G4D3N                1852
#define CLC3GLS3_G4D3T                1853
#define LC3G4D3T                      1854
#define LC3G4D4N                      1855
#define CLC3GLS3_G4D4N                1856
#define LC3G4D4T                      1857
#define CLC3GLS3_G4D4T                1858
#define CLC4CON                       1859
#define LC4MODE                       1860
#define CLC4CON_MODE                  1861
#define LC4MODE0                      1862
#define CLC4CON_MODE0                 1863
#define LC4MODE1                      1864
#define CLC4CON_MODE1                 1865
#define LC4MODE2                      1866
#define CLC4CON_MODE2                 1867
#define LC4INTN                       1868
#define CLC4CON_INTN                  1869
#define CLC4CON_INTP                  1870
#define LC4INTP                       1871
#define CLC4CON_OUT                   1872
#define LC4OUT                        1873
#define CLC4CON_EN                    1874
#define LC4EN                         1875
#define CLC4POL                       1876
#define CLC4POL_G1POL                 1877
#define LC4G1POL                      1878
#define CLC4POL_G2POL                 1879
#define LC4G2POL                      1880
#define CLC4POL_G3POL                 1881
#define LC4G3POL                      1882
#define LC4G4POL                      1883
#define CLC4POL_G4POL                 1884
#define LC4POL                        1885
#define CLC4POL_POL                   1886
#define CLC4SEL0                      1887
#define CLC4SEL0_D1S0                 1888
#define LC4D1S0                       1889
#define CLC4SEL0_D1S                  1890
#define LC4D1S                        1891
#define CLC4SEL0_D1S1                 1892
#define LC4D1S1                       1893
#define CLC4SEL0_D1S2                 1894
#define LC4D1S2                       1895
#define CLC4SEL0_D1S3                 1896
#define LC4D1S3                       1897
#define CLC4SEL0_D1S4                 1898
#define LC4D1S4                       1899
#define CLC4SEL0_D1S5                 1900
#define LC4D1S5                       1901
#define CLC4SEL1                      1902
#define LC4D2S0                       1903
#define CLC4SEL1_D2S                  1904
#define CLC4SEL1_D2S0                 1905
#define LC4D2S                        1906
#define CLC4SEL1_D2S1                 1907
#define LC4D2S1                       1908
#define LC4D2S2                       1909
#define CLC4SEL1_D2S2                 1910
#define LC4D2S3                       1911
#define CLC4SEL1_D2S3                 1912
#define LC4D2S4                       1913
#define CLC4SEL1_D2S4                 1914
#define LC4D2S5                       1915
#define CLC4SEL1_D2S5                 1916
#define CLC4SEL2                      1917
#define LC4D3S                        1918
#define CLC4SEL2_D3S                  1919
#define CLC4SEL2_D3S0                 1920
#define LC4D3S0                       1921
#define LC4D3S1                       1922
#define CLC4SEL2_D3S1                 1923
#define CLC4SEL2_D3S2                 1924
#define LC4D3S2                       1925
#define CLC4SEL2_D3S3                 1926
#define LC4D3S3                       1927
#define CLC4SEL2_D3S4                 1928
#define LC4D3S4                       1929
#define CLC4SEL2_D3S5                 1930
#define LC4D3S5                       1931
#define CLC4SEL3                      1932
#define LC4D4S0                       1933
#define LC4D4S                        1934
#define CLC4SEL3_D4S0                 1935
#define CLC4SEL3_D4S                  1936
#define LC4D4S1                       1937
#define CLC4SEL3_D4S1                 1938
#define LC4D4S2                       1939
#define CLC4SEL3_D4S2                 1940
#define LC4D4S3                       1941
#define CLC4SEL3_D4S3                 1942
#define LC4D4S4                       1943
#define CLC4SEL3_D4S4                 1944
#define LC4D4S5                       1945
#define CLC4SEL3_D4S5                 1946
#define CLC4GLS0                      1947
#define CLC4GLS0_D1N                  1948
#define LC4G1D1N                      1949
#define CLC4GLS0_D1T                  1950
#define LC4G1D1T                      1951
#define CLC4GLS0_D2N                  1952
#define LC4G1D2N                      1953
#define CLC4GLS0_D2T                  1954
#define LC4G1D2T                      1955
#define CLC4GLS0_D3N                  1956
#define LC4G1D3N                      1957
#define CLC4GLS0_D3T                  1958
#define LC4G1D3T                      1959
#define CLC4GLS0_D4N                  1960
#define LC4G1D4N                      1961
#define CLC4GLS0_D4T                  1962
#define LC4G1D4T                      1963
#define CLC4GLS1                      1964
#define CLC4GLS1_D1N                  1965
#define LC4G2D1N                      1966
#define CLC4GLS1_D1T                  1967
#define LC4G2D1T                      1968
#define LC4G2D2N                      1969
#define CLC4GLS1_D2N                  1970
#define LC4G2D2T                      1971
#define CLC4GLS1_D2T                  1972
#define CLC4GLS1_D3N                  1973
#define LC4G2D3N                      1974
#define LC4G2D3T                      1975
#define CLC4GLS1_D3T                  1976
#define CLC4GLS1_D4N                  1977
#define LC4G2D4N                      1978
#define CLC4GLS1_D4T                  1979
#define LC4G2D4T                      1980
#define CLC4GLS2                      1981
#define CLC4GLS2_D1N                  1982
#define LC4G3D1N                      1983
#define CLC4GLS2_D1T                  1984
#define LC4G3D1T                      1985
#define LC4G3D2N                      1986
#define CLC4GLS2_D2N                  1987
#define LC4G3D2T                      1988
#define CLC4GLS2_D2T                  1989
#define CLC4GLS2_D3N                  1990
#define LC4G3D3N                      1991
#define CLC4GLS2_D3T                  1992
#define LC4G3D3T                      1993
#define LC4G3D4N                      1994
#define CLC4GLS2_D4N                  1995
#define LC4G3D4T                      1996
#define CLC4GLS2_D4T                  1997
#define CLC4GLS3                      1998
#define CLC4GLS3_G4D1N                1999
#define LC4G4D1N                      2000
#define LC4G4D1T                      2001
#define CLC4GLS3_G4D1T                2002
#define LC4G4D2N                      2003
#define CLC4GLS3_G4D2N                2004
#define LC4G4D2T                      2005
#define CLC4GLS3_G4D2T                2006
#define CLC4GLS3_G4D3N                2007
#define LC4G4D3N                      2008
#define CLC4GLS3_G4D3T                2009
#define LC4G4D3T                      2010
#define LC4G4D4N                      2011
#define CLC4GLS3_G4D4N                2012
#define LC4G4D4T                      2013
#define CLC4GLS3_G4D4T                2014
#define STATUS_SHAD                   2015
#define C_SHAD                        2016
#define DC_SHAD                       2017
#define Z_SHAD                        2018
#define WREG_SHAD                     2019
#define BSR_SHAD                      2020
#define PCLATH_SHAD                   2021
#define FSR0L_SHAD                    2022
#define FSR0H_SHAD                    2023
#define FSR1L_SHAD                    2024
#define FSR1H_SHAD                    2025
#define STKPTR                        2026
#define TOSL                          2027
#define TOSH                          2028

#endif // _PIC16F18324_H_
